export const rude_words = [
	'傻逼', '白痴', '蠢货', '弱智', '傻子', '废物', '下贱', '低能', '无能', '死妈', '恶心', '不知死活', '活得不耐烦',
	'骂人', '人身攻击', '歧视', '侮辱', '生气', '呃呃', '阴阳怪气', '死',
	'禁言', '踢了', '飞了', '杀了', '肏了', '丧家之犬', '蠢逼', '和我做',
	'没爹', '没母', '没父', '没人养',
]
export const Kaomoji_list = [
	'(*´▽｀*)ヾ', '(＃￣ω￣)', '(￣▽￣)ノ',
	'(⊙ω⊙)', '(｡•̀ᴗ-)✧', '(*/ω＼*)',
	'(｀・ω・´)', '(￣▽￣)', '(*°∀°)=3',
	'ヾ(^▽^*)', '(*´▽`*)', '(≧▽≦)',
	'(⁄ ⁄•⁄ω⁄•⁄ ⁄)', '(｡♥‿♥｡)', '(￣︶￣)',
	'(๑•̀ㅂ•́)و ', '(╯°□°)╯', '(≧∇≦)/',
	'⊙ω⊙', '(*≧ω≦)', '(*≧▽≦)ノ',
	'(〃￣︶￣〃)', '（*´▽｀*）', '(っ´ω`)っ',
	'( ̩̩̩(˃̣̣̥A˂̣̣̥ )', '(´∀`)', '(´・ω・`)',
	'(´∩ω∩`)', '(´；ω；`)', '(´∀`*)',
	'(´∩｡• ᵕ •｡∩`)', '(´꒳`)', '(´｡• ω •｡`)',
	'(´-ω-`)', '(´,,•ω•,,`)', '(๑´ω`๑)',
	'`ω`', '( ´ ω ` )', '(・ω・)',
	'(* ´ ω ` *)', '(o´ω`o)', 'ヽ( ´ ω ` )ﾉ',
	'(ﾉ´ ω `)ﾉ', '(っ´ω`c)', '(´ω` )/',
	'(ゝω・)☆', '( >ω< )', '┐(´ω`)┌',
	'( • ̀ω•́ )✧', '|ω・)', '|ω・)ﾉ',
	'(*ﾉωﾉ)', '(//´/ω/`//)', '( ; ´ ω ` )',
	'(・ω・｀)？', '(・ω・`三`・ω・)', '(`・`ω´・´)',
	'(^・ω・^)', '(=´ω`=)', 'ଲ(’ω’ଲ)'
]

export function remove_kaomoji(text) {
	for (const kaomoji of Kaomoji_list)
		text = text.replaceAll(kaomoji, '')
	return text
}

export const lewd_words = [
	'一夜情', '一柱擎天', '乱伦', '乳交', '乳牛', '乳穴', '乳肉', '云雨', '交配', '假阳具', '做爱',
	'先走汁', '内射', '前列腺液', '勃起', '包皮', '发情', '发春', '口交', '后入', '后入式', '后庭',
	'喷乳', '喷奶', '大奶子', '大屌', '女体', '女肉', '奶子', '奶水', '奸淫', '妖艳', '挑逗', '撩拨', '爱抚',
	'娇喘', '婊子', '子孙袋', '子宫', '射精', '小穴', '尻', '屁眼', '屁穴', '屁股', '屄唇',
	'屄豆', '屌', '巨炮', '快感', '怀孕', '性交', '性器', '性奴', '情欲', '手淫',
	'打飞机', '抠逼', '抽插', '指奸', '按摩棒', '振动棒', '春药', '放荡', '春心',
	'极乐', '欲仙', '欲壑', '欲海', '欲火', '油肉', '油臀', '泄身', '浪叫', '浪娃',
	'浪肉', '浪荡', '淫乳', '淫水', '淫穴', '淫肉', '淫荡', '淫语', '淫贱', '淫靡', '深喉',
	'滑腻', '滚床单', '潮吹', '激情', '灌肠', '爆肏', '破处', '精水', '精液',
	'绳艺', '美肉', '美臀', '美艳', '翘臀', '老二', '肉便器', '肉奴', '肉棍', '肉棒', '肉棒汁', '肉欲', '肉瓣', '肉畜',
	'肉臀', '肉茎', '肛交', '肛门', '肠液', '肥臀', '自慰器', '荡妇', '荷尔蒙', '菊穴', '菊花', '蜜穴', '调情',
	'豪乳', '贱乳', '贱肉', '贱臀', '跳蛋', '销魂', '阳具', '阴唇', '阴毛', '阴茎', '阴蒂', '阴道', '雌体', '雌肉',
	'震动棒', '飞机杯', '骆驼趾', '骚b', '骚比', '骚肉', '骚臀', '骚货', '骚逼', '鸡巴'
]
